Repository: Muppet1313/freeaps
Catalog: FreeAPS/Sources/Localizations/Descriptions/*.lproj/Descriptions.strings
Languages: sv

source: This feature, enabled by default, resets the autosens ratio to neutral when you rewind your pump, on the assumption that this corresponds to a probable site change. Autosens will begin learning sensitivity anew from the time of the rewind, which may take up to 6 hours. If you usually rewind your pump independently of site changes, you may want to consider disabling this feature.
sv: Denna funktion, på som förval, återställer 'autosens ratio' till neutralt läge vid reservoarbyten, då det antas att du vid detta tillfälle även byter infusionskanyl. 'Autosens' kommer nu börja lära sig din insulinkänslighet på nytt, vilket kan ta upp till 6 timmar. Om du vanligtvis gör reservoarbyten oberoende av kanylbyten, kanske du ska överväga att inaktivera denna funktion.

source: Defaults to false. When set to true, raises sensitivity (lower sensitivity ratio) for temp targets set to >= 111. Synonym for exercise_mode. The higher your temp target above 110 will result in more sensitive (lower) ratios, e.g., temp target of 120 results in sensitivity ratio of 0.75, while 140 results in 0.6 (with default halfBasalTarget of 160).
sv: Av som förval. När den är på höjs insulinkänsligheten (lägre 'sensitivity ratio') för temporära målvärden >= 6.2 mmol/l. Synonymt med träningsläge, 'Exercise Mode '. Ju högre ditt temporära mål över 6,2 är desto mer kommer det att resultera i ett känsligare (lägre) 'sensitivity ratio', t.ex. kommer ett temp målvärde på 6.7 mmol/l att resultera i ett 'sensitivity ratio' på 0,75, medan 7,8 mmol/l resulterar i 0,6 (med 'halfBasalTarget' på 8,9 mmol/l på som förval).

source: Defaults to false. When set to true, can lower sensitivity (higher sensitivity ratio) for temptargets <= 99. The lower your temp target below 100 will result in less sensitive (higher) ratios, e.g., temp target of 95 results in sensitivity ratio of 1.09, while 85 results in 1.33 (with default halfBasalTarget of 160).
sv: Förvalt läge är av. Vid läge på, sänks insulinkänsligheten (högre 'sensitivity ratio') för temporära målvärden >= 99 mg/dl (5,5 mmol/l). Ju lägre ditt temporära mål under 100 (5,6 mol/l) desto mer kommer det att resultera i ett mindre känsligt (högre) 'sensitivity ratio', t.ex. kommer ett temp målvärde på 95 (5,3 mol/l) resultera i ett 'sensitivity ratio' på 0,75, medan 85 resulterar i 0,6 (med förvalt 'halfBasalTarget' på 160 (8,9 mol/l)).

source: When true, raises BG target when autosens detects sensitivity
sv: Höjer målvärde för blodsocker när 'autosens' upptäcker ökad insulinkänslighet

source: Defaults to false. When true, will lower BG target when autosens detects resistance
sv: Av som standardvärde. Sänker målvärde för blodsocker när 'autosens' upptäcker minskad insulinkänslighet

source: This feature was previously enabled by default but will now default to false (will NOT be enabled automatically) in oref0 0.6.0 and beyond. (There is no need for this with 0.6.0). This feature lowers oref0’s target BG automatically when current BG and eventualBG are high. This helps prevent and mitigate high BG, but automatically switches to low-temping to ensure that BG comes down smoothly toward your actual target. If you find this behavior too aggressive, you can disable this feature. If you do so, please let us know so we can better understand what settings work best for everyone.
sv: Denna funktion var tidigare aktiverad som förval, men kommer nu att vara av (kommer INTE att aktiveras automatiskt) i oref0 0.6.0 och senare. (Det finns inget behov av detta med 0.6.0). Denna funktion sänker oref0:s blodsockermålvärde automatiskt när nuvarande och förväntat blodsocker är högt. Detta hjälper till att förebygga och mildra ett högt blodsocker, men växlar automatiskt till låg temporär basaldos för att säkerställa att blodsocker landar mjukt på ditt faktiska målvärde.

source: Defaults to false. When true, > 105 mg/dL high temp target adjusts sensitivityRatio for exercise_mode. Synonym for high_temptarget_raises_sensitivity
sv: Av som förval. När på kommer ett temporärt målvärde > 5,8 mmol/l att justera 'sensitivityRatio' för 'Exercise Mode'. Synonymt med 'High Temptarget raises sensitivity'.

source: Defaults to false, which means by default only the low end of the pump’s BG target range is used as OpenAPS target. This is a safety feature to prevent too-wide targets and less-optimal outcomes. Therefore the higher end of the target range is used only for avoiding bolus wizard overcorrections. Use wide_bg_target_range: true to force neutral temps over a wider range of eventualBGs.
sv: Av som förval, vilket innebär att endast den lägre änden av dina målvärden används som målvärde i FreeAPS X. Detta är en säkerhetsfunktion för att förhindra alltför omfattande målintervall och mindre optimala resultat. Den högre änden av målvärdet används endast för att undvika överkorrigeringar av bolusguiden. Använd Wide BG Target Range för att forcera neutrala temporära basaldoser att användas över ett bredare intervall av förväntade blodsocker.

source: Defaults to false, so that OpenAPS will set temps whenever it can, so it will be easier to see if the system is working, even when you are offline. This means OpenAPS will set a “neutral” temp (same as your default basal) if no adjustments are needed. If you are a light sleeper and the “on the hour” buzzing or beeping wakes you up (even in vibrate mode), you may want to turn this to “true” to skip setting neutral temps. However, we recommend leaving neutral temps enabled for most people who will be using this system on the go and out of constant connectivity. Note: if set to true, in order to reduce notifications at the top of the hour, it will also attempt to cancel temp basals (unless BG or minGuardBG is below threshold and a zero-temp is needed) prior to the top of the hour. Normally a new temp basal will be set (if still needed) after the top of the hour, but that may be delayed if the rig has issues connecting to the pump. People who want to minimize the ‘on the hour’ temp basal notification beeps/vibrations may choose to accept that risk and choose to set skip_neutral_temps to true.
sv: Av som förval, så att FreeAPS X kan ställa in temporära basaldoser närhelst den kan, vilket gör det lättare att se ifall systemet fungerar, även när du är offline. Detta innebär att FreeAPS X kommer att ställa in en ”neutral” temp (samma som din ordinarie basal) när inga justeringar behövs. Om du vanligtvis vaknar lätt, och av de timvisa surrande eller pipande ljuden vaknar upp (även i vibrerande läge), kanske du vill ställa in denna inställning som På för att hoppa över alla neutrala temporärinställningar. Vi rekommenderar dock att man lämnar neutrala temporära basaler aktiverade för de flesta som kommer att använda detta system på språng och utan ständig internetanslutning. Obs: om på, för att minska notiser mitt i natten, kommer den också att försöka avbryta temporära basaler (om inte BS eller 'minGuardBG' är under tröskelvärde och en noll-temp behövs) före en ny timme påbörjats. Normalt kommer en ny temp basal att ställas in (om det fortfarande behövs) efter påbörjad ny timme, men det kan fördröjas om riggen har problem med att ansluta till pumpen. Personer som vill minimera timvisa' temporära basalnotisers pip / vibrationer kan välja att acceptera den risken och aktivera 'Skip Neutral Temps''.

source: Many people occasionally forget to resume / unsuspend their pump after reconnecting it. If you’re one of them, and you are willing to reliably set a zero temp basal whenever suspending and disconnecting your pump, this feature has your back. If enabled, it will automatically resume / unsuspend the pump if you forget to do so before your zero temp expires. As long as the zero temp is still running, it will leave the pump suspended.
sv: Vissa glömmer ibland att återuppta sin insulintillförsel efter att ha pausat den. För dessa, som är villiga att tillförlitligt ställa in en noll temporär basal vid paus av pump, kan denna funktion hjälpa dig. Om aktiverad återupptas pumpen, om du skulle glömma att göra detta själv innan temp basalen på 0 IE/h går ut. Så länge temp. basalen på 0 är igång kommer pumpen att vara avstängd.

source: With this option enabled, the SMB algorithm can recognize unannounced meals. This is helpful, if you forget to tell AndroidAPS about your carbs or estimate your carbs wrong and the amount of entered carbs is wrong or if a meal with lots of fat and protein has a longer duration than expected. Without any carb entry, UAM can recognize fast glucose increasments caused by carbs, adrenaline, etc, and tries to adjust it with SMBs. This also works the opposite way: if there is a fast glucose decreasement, it can stop SMBs earlier.
sv: Med denna inställning på kan SMB-algoritmen upptäcka kolhydrater som inte matats in. Detta kan vara till hjälp, om du glömmer att mata in eller uppskattar dina kolhydrater fel, fel eller vid måltider med mycket fett och protein, som har en längre verkan än förväntat. Utan inlagda kolhydrater kan UAM känna igen snabba glukosförändringar orsakade av kolhydrater, adrenalin, etc, och försöker justera dessa med SMBs. Detta fungerar också omvänt: vid snabb glukosminskning stoppas SMB:s tidigare.

source: This enables supermicrobolus (SMB) while carbs on board (COB) are positive.
sv: Detta tillåter supermikrobolusar (SMB) medan det finns aktiva kolhydrater (COB).

source: This enables supermicrobolus (SMB) with eating soon / low temp targets. With this feature enabled, any temporary target below 100mg/dL, such as a temp target of 99 (or 80, the typical eating soon target) will enable SMB.
sv: Detta tillåter supermikrobolusar (SMB) vid 'äter snart'/låga temp mål. Med denna funktion aktiverad, kommer alla tillfälliga mål under 100mg/dL (5,6 mmol/l), såsom ett temporärt målvärde på 5,5 (eller 4,4 mmol/l, det typiska 'äter snart - målvärdet') att möjliggöra SMB.

source: Defaults to false. When true, always enable supermicrobolus (unless disabled by high temptarget).
sv: Av som förval. Vid läge på, tillåts alltid supermikrobolusar (SMB) (om inte inaktiverat av högt målvärde).

source: Defaults to false. When true, enables supermicrobolus (SMB) for 6h after carbs, even with 0 carbs on board (COB).
sv: Av som förval. Vid läge på, möjliggörs supermikrobolsar (SMB) även 6h efter kolhydrater, även med 0 aktiva kolhydrater (COB).

source: Defaults to false. When true, allows supermicrobolus (if otherwise enabled) even with high temp targets.
sv: Av som förval. När läge på, tillåts SMB (om annars aktiverat) även vid höga temporära målvärden.

source: Defaults to false. Setting to true allows changing insulinPeakTime
sv: Av som förval. Läge på tillåter ändring av 'insulinPeakTime'

source: Max IOB is the maximum amount of insulin on board from all sources – both basal (or SMB correction) and bolus insulin – that your loop is allowed to accumulate to treat higher-than-target BG. Unlike the other two OpenAPS safety settings (max_daily_safety_multiplier and current_basal_safety_multiplier), max_iob is set as a fixed number of units of insulin.
sv: Max IOB är den maximala mängden aktivt insulin från alla källor – både basal (eller SMB korrigering) och bolusinsulin – som din loop tillåts att ackumulera för att behandla BS högre än målvärdet. Till skillnad från de andra två säkerhetsinställningarna i FreePAS X ('Max Daily Safety Multiplier' och 'Current Basal Safety Multiplier'), är 'Max IOB' inställd som ett fast antal insulinenheter.

source: This is an important OpenAPS safety limit. The default setting (which is unlikely to need adjusting) is 3. This means that OpenAPS will never be allowed to set a temporary basal rate that is more than 3x the highest hourly basal rate programmed in a user’s pump, or, if enabled, determined by autotune.
sv: Detta är en viktig säkerhetsgräns för FreeAPS X. Standardinställningen (som sannolikt inte behöver justeras) är 3. Detta innebär att FreeAPS Xaldrig kommer att tillåtas att ställa in en temporär basaldos som är mer än 3x den högsta basaldosen inställd i en användares pump, eller, om aktiverad, den som är ställs in av 'Autotune'.

source: This is another important OpenAPS safety limit. The default setting (which is also unlikely to need adjusting) is 4. This means that OpenAPS will never be allowed to set a temporary basal rate that is more than 4x the current hourly basal rate programmed in a user’s pump, or, if enabled, determined by autotune.
sv: Detta är en viktig säkerhetsgräns i FreeAPS X. Standardinställningen (som sannolikt inte behöver justeras) är 4, vilket innebär att det aldrig kommer att tillåtas att ställa in en temporär basaldos som är mer än 4x den högsta ordinarie basaldosen, sparad i pumpen, eller, om aktiverad, den som är ställts in av 'Autotune'.

source: This is a multiplier cap for autosens (and autotune) to set a 20% max limit on how high the autosens ratio can be, which in turn determines how high autosens can adjust basals, how low it can adjust ISF, and how low it can set the BG target.
sv: Standardvärde: 1.2. Denna multipel begränsar hur mycket autosens (och autotune) automatiskt kan justera upp basaler, sänka insulinkänslighet och/eller målvärde. Med standardvärde upp till 20%.

source: The other side of the autosens safety limits, putting a cap on how low autosens can adjust basals, and how high it can adjust ISF and BG targets.
sv: Standardvärde: 0.7. Denna multipel begränsar hur mycket autosens (och autotune) automatiskt kan justera ned basaler och öka insulinkänslighet och/eller målvärde.

source: Set to a number, e.g. 160, which means when temp target is 160 mg/dL and exercise_mode=true, run 50% basal at this level (120 = 75%; 140 = 60%). This can be adjusted, to give you more control over your exercise modes.
sv: Inställd till ett blodsockervärde, t.ex. 160 (mg/dl = 8.9 mmol/l), vilket innebär att när det temporära målvärdet är 8.9 mmol/l och 'Exercise Mode' är på, används endast 50% basal vid detta blodsocker (120 = 75%; 140 = 60%). Detta kan justeras, för att ge dig mer kontroll över dina temporära målvärden vid träning.

source: This defaults maxCOB to 120 because that’s the most a typical body can absorb over 4 hours. (If someone enters more carbs or stacks more; OpenAPS will just truncate dosing based on 120. Essentially, this just limits AMA as a safety cap against weird COB calculations due to fluky data.)
sv: Standardvärde 120, eftersom det är vad kroppen typiskt här anses absorbera över 4 timmar. (I händelse att någon matar in mer/överlappar mer kolhydrater, kommer FreeAPS X minska dosering baserad på 120. I grund och botten begränsar detta endast AMA, med ett tak, för skydd mot felaktiga aktiva kolhydrater-beräkningar på grund av opålitlig data.)

source: Bolus snooze is enacted after you do a meal bolus, so the loop won’t counteract with low temps when you’ve just eaten. The example here and default is 2, so a 3 hour DIA means that bolus snooze will be gradually phased out over 1.5 hours (3DIA/2).
sv: Denna är aktiv efter att du givit en måltidsbolus, för att motverka en låg temporär basal när du just ätit. I detta exempel med standardvärdet 2 och med DIA på 3 h kommer 'Bolus Snooze' att fasas ut över 1,5 h (3 DIA / 2).

source: This is a setting for default carb absorption impact per 5 minutes. The default is an expected 8 mg/dL/5min. This affects how fast COB is decayed in situations when carb absorption is not visible in BG deviations. The default of 8 mg/dL/5min corresponds to a minimum carb absorption rate of 24g/hr at a CSF of 4 mg/dL/g.
sv: Standardvärde är 8 mg/dl/5min (0,4 mmol/l/5 min). Detta är en inställning för kolhydratsabsorptionseffekt per 5 minuter, som påverkar hur snabbt aktiva kolhydrater klingar av i situationer när kolhydratsabsorption inte syns i BS-avvikelser. Standarden på 0,4 mmol/l/5 min motsvarar en minsta absorptionshastighet på 24g/h vid en CSF ('Carb Sensitivity Factor', hur snabbt din blodsocker stiger per gram kolhydrat) på 0,2 mmol/l/g.

source: The default of 0.5 for this value keeps autotune ISF closer to pump ISF via a weighted average of fullNewISF and pumpISF. 1.0 allows full adjustment, 0 is no adjustment from pump ISF.
sv: Standardvärde 0,5 för detta värde håller 'autotune ISF' närmare pumpens ISF (insulinkänslighet) via ett viktat genomsnitt av 'fullNewISF' och 'pumpISF'. Värde 1.0 tillåter full justering, medan 0 innebär att ingen skillnad från pumpens ISF kommer att föreligga.

source: This is the fraction of carbs we’ll assume will absorb over 4h if we don’t yet see carb absorption.
sv: Del av kolhydrater som vi antar kommer att absorberas över 4h om vi ännu inte ser 'carb absorption'.

source: This is the amount of the maximum number of carbs we’ll assume will absorb over 4h if we don’t yet see carb absorption.
sv: Mängd av maximala antal kolhydrater som vi antar kommer att absorberas över 4h om vi ännu inte ser 'carb absorption'.

source: Defaults to start at 30. This is the maximum minutes of basal that can be delivered as a single SMB with uncovered COB. This gives the ability to make SMB more aggressive if you choose. It is recommended that the value is set to start at 30, in line with the default, and if you choose to increase this value, do so in no more than 15 minute increments, keeping a close eye on the effects of the changes. It is not recommended to set this value higher than 90 mins, as this may affect the ability for the algorithm to safely zero temp. It is also recommended that pushover is used when setting the value to be greater than default, so that alerts are generated for any predicted lows or highs.
sv: Standardvärdet börjar vid 30. Detta är det maximala antal minuter av din ordinarie basal som kommer att ges som en SMB. Denna inställning ger möjlighet att göra SMB större behandlingen med SMB mer aggressiv. Det rekommenderas att börja med 30 minuter, och om du väljer att öka detta värde, gör det stegvis i högst 15 minuters steg, samtidigt som du noga följer effekterna av nya inställningarna. Det rekommenderas inte att ställa in detta värde högre än 90 minuter, eftersom detta påverkar algoritmens förmåga att säkert kunna balansera med temporära balsaler på 0 IE/h. Det rekommenderas också att pushover används när värdet sätts till att vara större än standard, så att varningar och notiser kan genereras för alla förväntade blodsockerdalar eller toppar.

source: Defaults to start at 30. This is the maximum minutes of basal that can be delivered by UAM as a single SMB when IOB exceeds COB. This gives the ability to make UAM more or less aggressive if you choose. It is recommended that the value is set to start at 30, in line with the default, and if you choose to increase this value, do so in no more than 15 minute increments, keeping a close eye on the effects of the changes. Reducing the value will cause UAM to dose less insulin for each SMB. It is not recommended to set this value higher than 60 mins, as this may affect the ability for the algorithm to safely zero temp. It is also recommended that pushover is used when setting the value to be greater than default, so that alerts are generated for any predicted lows or highs.
sv: Standardvärdet börjar vid 30. Detta är det maximala antal minuter av din ordinarie basal som kommer att användas för UAM för att ges som en SMB. Denna inställning ger möjlighet att göra behandlingen med UAM mer aggressiv, om du väljer att öka detta värde. Det rekommenderas att börja med 30 minuter, och om du väljer att öka detta värde, gör det stegvis i högst 15 minuters steg, samtidigt som du noga följer effekterna av nya inställningarna. En reducering av värdet leder till att UAM doserar mindre insulin med varje SMB. Det rekommenderas inte att ställa in detta värde högre än 60 minuter, eftersom detta påverkar algoritmens förmåga att säkert kunna balansera med temporära balsaler på 0 IE/h. Det rekommenderas också att pushover används när värdet sätts till att vara större än standard, så att varningar och notiser kan genereras för alla förväntade blodsockerdalar eller toppar.

source: Minimum duration in minutes between two enacted SMBs
sv: Minsta tidsintervall mellan två SMB:ar

source: Smallest possible bolus amount
sv: Minsta möjliga bolusdos

source: Maximun blood glucose lowering effect of insulin, in minutes
sv: Maximal blodsockersänkande effekt av insulin, i minuter

source: Grams of carbsReq to trigger a pushover. Defaults to 1 (for 1 gram of carbohydrate). Can be increased if you only want to get Pushover for carbsReq at X threshold.
sv: Gram 'carbsReq' (kolhydrater som krävs för att undvika för lågt BS-värde) som krävs för att utlösa en pushover-notis. Standard är 1 (för 1 gram kolhydrat). Kan ökas om du bara vill få Pushover-notis för 'carbsReq' vid tröskelvärde X.

source: Nothing here yet...
sv: Saknas info här för tillfället...
